In [6]:
import pandas

In [7]:
names=["Tom√°s", "Pauline", "Pablo", "Bjork","Alan","Juana"]
woman=[False,True,False,False,False,True]
ages=[32,33,28,30,32,27]
country=["Chile", "Senegal", "Spain", "Norway","Peru","Peru"]
education=["Bach", "Bach", "Master", "PhD","Bach","Master"]

In [8]:
friends={'names':names, 'woman':woman, 'ages':ages, 'country':country, 'education':education}
#Creates dict

In [9]:
friends=pandas.DataFrame.from_dict(friends) #Creates dataframe

In [10]:
friends[friends.woman==False].sort_values('ages',ascending=True).head(1)

   names  woman  ages country education
2  Pablo  False    28   Spain    Master

In [13]:
friends.min().ages

27

In [ ]:
friends.where(woman == False)